package org.example.zadanye4;

public class Main4 {
    public static void main(String[] args) {
        System.out.println("""
            Модуль 15. Поиск работы и продвинутые темы. Задание №1. Проект:
            Шаг 4:
            Добавляем новые файлы на ПК и переносим их в удалённый репозиторий
            Папка с файлами нашего репозитория хранится на рабочем столе. Чтобы продолжить работу,
            откроем проект в редакторе кода: можно выбрать любую программу, и GitHub Desktop предлагает
            воспользоваться Atom.
            В рамках данной инструкции будет показана работа с  репозиторием в Visual Studio Code
            — это бесплатный редактор от компании Microsoft.
            Создадим HTML-файл, добавим базовую структуру и посмотрим на боковое меню — HTML-файл
            подсвечен зелёным цветом. Это означает, что в проекте появились изменения и они ещё
            не добавлены в репозиторий на GitHub.
            Редактор кода подсвечивает зелёным цветом новые файлы
            Переходим в GitHub Desktop — созданный HTML-файл появится во вкладке Changes.
            Для его сохранения пишем коммит и переходим во вкладку History для просмотра
            изменений. Если изменения сохранились, нажимаем на Push origin и отправляем изменения в удалённый репозиторий.
            Новые файлы переносятся из редактора кода в GitHub Desktop:
            Создаём коммит и фиксируем изменения:
            HTML-файл в удалённом репозитории на GitHub:
            Файлы на GitHub полностью соответствуют файлам в редакторе кода. Это значит, что если с ПК что-то
            случится, мы сможем восстановить проект.

            Решение:
        """);

        System.out.println("""
            Скачал и установил на локальный компьютер приложение Visual Studio Code.
            В этом приложении открыл проект 'n240221_Module1_Task1_Zadaniya1-16' и создал в корневой папке проекта
            новый файл: 'index.html'.
            Перешёл в 'GitHub Desktop', убедился, что созданный HTML-файл появится во вкладке Changes.
            Нажал на 'Push origin' и отправил изменения в удалённый репозиторий.
            Скачал проект по ссылке из репозитория 'GitHub' на свой локальный компьютер.
            Нашёл в папке проекта в проводнике Windows файл 'index.html', открыл его в браузере, убедился, 
            что всё работает.
        """);
    }
}